/****** Script for SelectTopNRows command from SSMS  ******/
SELECT TOP (1000) [Табельний_номер]
      ,[Прізвище]
      ,[Ім'я]
      ,[По-батькові]
      ,[Дата_прийняття]
      ,[Контактний_номер]
  FROM [SUBD1].[dbo].[Працівники]

BEGIN TRANSACTION;
INSERT INTO [Прaцівники_2] 
VALUES (4,2, 'Марія', 'Котис','Батьківна', '12.02.2020', '0678126572');
INSERT INTO [Прaцівники_2] 
VALUES (5,1, 'Дмитро', 'Порода','Батькович', '10.03.2020', '0345678128');
INSERT INTO [Прaцівники_2] 
VALUES (6,3, 'Данило', 'Іванів','Батькович', '12.10.2020', '0468438761');
COMMIT;

