/****** Script for SelectTopNRows command from SSMS  ******/
SELECT TOP (1000) [Код_Товару]
      ,[Номер_клієнта]
      ,[Назва]
      ,[Опис]
      ,[Ціна]
  FROM [SUBD1].[dbo].[Товар]




/****** Запит на виконання проекції з таблиці  ******/
CREATE VIEW [Товар_1]
AS SELECT DISTINCT [Назва], [Опис], [Ціна] FROM [Товар]


/****** Запит на виконання селекції товару з іменем “Nike”:  ******/
SELECT * FROM [Товар]
WHERE [Назва]='Nike'

/****** Запит на виконання натурального з'єднання Товар і Клієнт:  ******/

Select [Товар].Назва, [Товар].Опис, [Товар].Ціна, [Клієнт].[Ім'я],
[Клієнт].Прізвище, [Клієнт].[По-батькові], [Клієнт].Номер_телефону from [Товар], [Клієнт]
where [Товар].Код_Товару=[Клієнт].Ідентифікаційний_номер_клієнта

/****** Запит на виконання умовного з'єднання Товар і Клієнт:  ******/

Select [Товар].Назва, [Товар].Опис, [Товар].Ціна, [Клієнт].[Ім'я],
[Клієнт].Прізвище, [Клієнт].[По-батькові], [Клієнт].Номер_телефону from [Товар], [Клієнт]
where [Товар].Код_Товару=[Клієнт].Ідентифікаційний_номер_клієнта and [Товар].Ціна>3000