/****** Script for SelectTopNRows command from SSMS  ******/
SELECT TOP (1000) [Ідентифікаційний_номер_клієнта]
      ,[Прізвище]
      ,[Ім'я]
      ,[По-батькові]
      ,[Номер_телефону]
      ,[Місто]
      ,[Вулиця]
      ,[Номер_будинку]
      ,[Email]
  FROM [SUBDLABA4].[dbo].[Клієнт]

  SELECT TOP (1000) [Код_Товару]
      ,[Назва]
      ,[Опис]
      ,[Ціна]
  FROM [SUBDLABA4].[dbo].[Товар]


  SELECT TOP (1000) [Код_чеку_товару]
      ,[Код_кольору_товару]
      ,[Табельний_номер]
      ,[Код_Товару]
      ,[Код_Магазину]
      ,[Дата_отримання_товару]
  FROM [SUBDLABA4].[dbo].[Чек_товару]

 SELECT [Назва],[Код_Товару] FROM [Товар] WHERE [Код_Товару] = 8 




 SELECT [Клієнт].[Ідентифікаційний_номер_клієнта], [Клієнт].[Ім'я], [Клієнт].[Email],
[Клієнт].[Номер_телефону], [Клієнт].[По-батькові]
FROM Клієнт LEFT JOIN [Чек_товару] ON
[Клієнт].[Ідентифікаційний_номер_клієнта] = [Чек_товару].[Код_Товару]



SELECT [Клієнт].[Ім'я], [Товар].[Назва], [Товар].[Ціна]
FROM [Клієнт] INNER JOIN [Товар] ON [Клієнт].[Ідентифікаційний_номер_клієнта] = [Товар].[Код_Товару]
WHERE [Назва] = 'Puma'


select [Товар].[Назва], [Клієнт].[Ідентифікаційний_номер_клієнта] from [Товар] inner join [Клієнт]
on [Товар].[Код_Товару]=[Клієнт].[Ідентифікаційний_номер_клієнта]
WHERE [Назва] = 'dr.martens'


SELECT TOP 3  [Клієнт].[Ім'я], [Товар].[Назва], [Товар].[Ціна]
FROM [Клієнт] JOIN [Товар] ON [Клієнт].[Ідентифікаційний_номер_клієнта] = [Товар].[Ціна]
JOIN [Товар] ON [Клієнт].[Ідентифікаційний_номер_клієнта] = [Товар].[Код_Товару]
ORDER BY [Товар].[Код_Товару] DESC

SELECT [Клієнт].[Ім'я], [Клієнт].Прізвище, [Клієнт].[По-батькові] FROM [Клієнт]
WHERE NOT EXISTS 
(SELECT * FROM [Товар] WHERE [Товар].[Код_Товару] = [Клієнт].[Ідентифікаційний_номер_клієнта])


SELECT [Назва], [Опис], [Ціна] FROM [Товар]
WHERE [Ціна] > 4000;



