/****** Script for SelectTopNRows command from SSMS  ******/
SELECT TOP (1000) [Код_Товару]
      ,[Назва]
      ,[Опис]
      ,[Ціна]
  FROM [SUBDLABA4].[dbo].[Товар]

 SELECT TOP (1000) [Код_чеку_товару]
      ,[Код_кольору_товару]
      ,[Табельний_номер]
      ,[Код_Товару]
      ,[Код_Магазину]
      ,[Дата_отримання_товару]
 FROM [SUBDLABA4].[dbo].[Чек_товару]



 SELECT TOP (1000) [Ідентифікаційний_номер_клієнта]
      ,[Прізвище]
      ,[Ім'я]
      ,[По-батькові]
      ,[Номер_телефону]
      ,[Місто]
      ,[Вулиця]
      ,[Номер_будинку]
      ,[Email]
  FROM [SUBDLABA4].[dbo].[Клієнт]

SELECT COUNT([Товар].[Код_Товару]) AS Кількість_Товарів FROM [Товар]
WHERE [Опис] LIKE '%krosivku%'





SELECT MONTH([Чек_товару1].[Дата_отримання_товару]) AS Month, DAY([Чек_товару1].[Дата_отримання_товару]) AS Day, 
COUNT([Чек_товару1].[Код_чеку_товару]) AS КількістьПроданих
FROM [Чек_товару1] GROUP BY MONTH([Чек_товару1].[Дата_отримання_товару]), DAY([Чек_товару1].[Дата_отримання_товару])



SELECT [Клієнт].[Ідентифікаційний_номер_клієнта], SUM([Товар].[Ціна]) AS Сума
FROM Клієнт LEFT JOIN [Товар] ON [Клієнт].[Ідентифікаційний_номер_клієнта]=[Товар].[Код_Товару]
GROUP BY [Клієнт].[Ідентифікаційний_номер_клієнта]


SELECT TOP 1 [Клієнт].[Ідентифікаційний_номер_клієнта], COUNT([Товар].[Код_Товару]) AS КількістьТоварів FROM [Клієнт]
JOIN [Товар] ON [Клієнт].[Ідентифікаційний_номер_клієнта] = [Товар].[Код_Товару]
GROUP BY [Клієнт].[Ідентифікаційний_номер_клієнта]
ORDER BY COUNT([Товар].[Код_Товару]) DESC

